In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame
stu=pd.read_excel('c:\data\studentsInfo.xlsx','Group3',index_col=0)

In [3]:
grouped=stu.groupby(['性别','年龄'])
grouped.aggregate({'身高':np.mean,'月生活费':np.max})

               身高  月生活费
性别     年龄
female 19  167.00   800
       20  164.50  1250
       21  162.25  1300
       22  160.00   800
male   21  175.00   900

In [4]:
pd.crosstab(stu['性别'],stu['月生活费'])

月生活费    700   800   900   950   1100  1200  1250  1300
性别
female     1     2     0     1     1     1     1     1
male       0     1     1     0     0     0     0     0